{"episodes":[{"id":"yK8fI2C97","title":"Pilot","synopsis":"Rick establishes himself as a bad influence on his grandson Morty when it's discovered that Morty has missed a semester of school in the time that he's spent on adventures with Rick. Rick takes Morty to another dimension, known as Dimension 35-C, which has the perfect conditions for growing \"Mega Trees\", which bear \"Mega Fruit\" holding \"Mega Seeds\", which Rick requires for his research. To get past intergalactic customs, Morty hides the Mega Tree seeds in his rectum, but when their cover is blown, Rick & Morty escape while engaging in a shootout with bureaucratic alien insects. Ultimately, the seeds are used to briefly make Morty highly intelligent, causing his parents to believe that he's fine with his education & let Rick stay. But the seeds' energy is wasted with Morty writhing from the aftereffects as Rick informs his grandson that they need to go back & get more before going into a nonsensical rant that they'll be going on a lot more crazy adventures.","season":1},{"id":"ThZ5euWJj","title":"Lawnmower Dog","synopsis":"Morty's dog Snuffles angers Jerry by continually urinating on the carpet. Upset, Jerry asks Rick for a device that could make Snuffles smarter. Rick makes the device, and it makes Snuffles smart enough for him to be able to do things like a normal human, like going to the bathroom. Meanwhile, Rick plans to enter the dreams of Morty's math teacher, Mr. Goldenfold, in order for him to increase Morty's grades, thus letting Morty adventure with Rick more often. The two enter Goldenfold's dream. The dream takes place on a plane, where Rick pretends to be a terrorist threatening to blow them up if Goldenfold does not give Morty better grades, but Goldenfold decides to fight back and pulls out two machine guns. Rick realizes that Goldenfold has more control over his dreams than he had anticipated, and also reveals that if they die in the dream, they die in real life. Meanwhile, Snuffles attempts to communicate with his owners verbally but is unable. He opens the battery compartment on the helmet and realizes that it can be boosted with additional batteries.\n\nStill stuck in the dream, Rick tries to negotiate with Goldenfold using his idol, Mrs. Pancakes, as a human shield. Instead, chaos descends on the plane. The doors to the plane are opened, and everyone gets sucked out. Mrs. Pancakes finds a parachute and opens it, while Goldenfold has already landed the plane. Rick and Morty grab onto Pancakes, but Goldenfold has created a device to pluck Pancakes out of the sky and leave Rick and Morty to fall in a pool of lava. The two then incept themselves into Pancakes' dreams to slow time down. Pancakes' dreams are of an intergalactic sex club and S&M dungeon, filled with dominatrices. A lingerie-clad Summer makes the two feel uncomfortable, making them stand out. A centaur guard threatens to kill them, and they venture into the centaur's dream, where the three have to run away from a \"legally safe knockoff\" of Freddy Krueger, named Scary Terry. Meanwhile, Snuffles has created a robotic arm and a speaker that he uses to grab things and communicate, albeit in broken English. Snuffles' view on life changes after watching a TV special about dogs being domesticated and being forced into subservience.\n\nStill finding an escape, Rick and Morty travel into a little girl's dream to escape Scary Terry. After returning to what looks like the same dream, the two also find out that Terry can travel across dreams. After building himself a powerful robotic suit, Snuffles changes his name to Snowball and assumes dominance over the household. While in a new dream, Rick and Morty are still being chased by Terry. The two follow him back into his house and enter his dreams. They see that he is fearful of being a failure in his job and save him from being embarrassed in school. In return, he helps them return to reality, and in the process, convince Goldenfold to raise Morty's grades. Back in the regular world, they find that Snowball has led an army of hyper-intelligent dogs to the verge of global domination over humanity. Snowball allows Morty to live by his side while the rest of the world is enslaved at the whim of the dogs. While the dogs are subjecting the humans to similar practices that the humans subjected the dogs to, Morty lives in luxury. Rick reveals to him that the two are actually in Snowball's dream. Rick poisons Morty's kidneys, making Snowball care for Morty's health. Snowball comes out of his dream and realizes that oppressing humans brings heartbreak and cruelty. Snowball and the dogs change their plan and decide instead to inhabit a world of their own.\n\nIn the post-credits scene, the old teacher of Scary Terry's class has been replaced by Scary Glenn, a hippie drum player. Rick and Scary Terry are sitting as his students, smoking marijuana, satisfied with this change.\n\n","season":1},{"id":"p3UHGadxG","title":"Anatomy Park","synopsis":"On Christmas, Rick shrinks Morty and sends him inside the synopsis of a homeless man named Reuben, once a doctor, to save his life. Inside Reuben’s synopsis is Anatomy Park (a parody of Jurassic Park), which houses various deadly diseases that escape their enclosures. Morty and one of the park staff, Annie, flee from the rampaging diseases, which kill the rest of the staff as well as Xenon. Rick ultimately rescues them by enlarging Reuben’s synopsis to the size of the United States before detonating it.\n\nMeanwhile at the family home, Jerry's parents visit along with a man named Jacob, and the family tries to bond without electronic devices at his demand. At lunch, Jerry is dismayed to discover his parents have been engaging in polyamory with Jacob, and soon comes to regret his wish for an electronic-free bonding. Summer’s boyfriend Ethan makes an appearance, enraged over her digital absence, and they fight briefly before reconciling with Jacob’s help. Suddenly, blood from Xenon’s remains rains from the sky, enveloping the outdoors.\n\nAnnie, Rick and Morty return to Earth, and Rick shrinks the former. The fully-sized humans return to the living room, and Rick berates the family for engrossing themselves in their electronics on Christmas.\n\nIn a post-credits scene, Rick contacts Annie and her new associates inside his new patient's synopsis in hopes of recreating Anatomy Park. He hangs up in frustration, and the patient is revealed to be Summer’s boyfriend, Ethan.\n\n","season":1},{"id":"PmYHiZy7N","title":"M. Night Shaym-Aliens!","synopsis":"Aliens hold Rick and Jerry captive in a virtual reality, in an attempt to steal Rick's recipe for Concentrated Dark Matter. As Rick repeatedly attempts escape with Morty (later revealed to be a simulation), he discovers that there are multiple virtual realities layered on top of each other. In contrast, Jerry—despite numerous system glitches—remains completely oblivious, and continually attempts to sell his advertising slogan for apples. Rick finally outsmarts the aliens by giving them a fake recipe, who send Rick and Jerry back to Earth. Their ship explodes as they prepare the concoction.\n\nIn a post-credits scene, Jerry is fired on the spot after debuting his new advertising slogan in the real world. At night, a drunk Rick enters Morty's room and threatens him with a knife, demanding to know if Morty is a simulation. His earnest terror convinces Rick of his innocence, and Rick apologizes before passing out.\n\n","season":1},{"id":"h6zwKVuVL","title":"Meeseeks and Destroy","synopsis":"After a traumatic adventure, Morty strikes a bet with Rick to lead his own. When the other Smiths ask Rick for solutions to several mundane problems, he gives them a Meeseeks Box: a gadget capable of summoning blue humanoids all named \"Mr. Meeseeks\". They live in pain until executing the task they’re given, and then vanish. Rick warns the family to keep their tasks simple.\n\nJerry summons a Meeseeks to take two strokes off his golf game, but struggles. The frustrated creature summons another Meeseeks for help. Soon, Jerry is surrounded by many desperate Meeseeks, yet still cannot improve. Giving in, he and Beth go to dinner together in spite of the Meeseeks' protests. The dumbfounded Meeseeks brawl amongst themselves before concluding that their only hope is to kill Jerry (thus taking all strokes off his game).\n\nA horde of Meeseeks descend upon the restaurant, taking hostages to coerce Jerry out of hiding. Beth convinces him to try his golf swing one last time. Jerry uses a pipe and tomato to demonstrate that his game has improved, and the Meeseeks cease to exist.\n\nConcurrently, Rick and Morty arrive in a poor village in a medieval fantasy world, who request their help to steal a giant's treasure in order to raise money. They climb up a giant beanstalk to the giants' world, but a fatal accident sees them arrested for “murdering” a giant. They are tried in a Giant's Court, but are acquitted via technicality.\n\nThe duo stop at a tavern, and Morty heads to the bathroom. There, an initially gregarious Mr. Jellybean attempts to rape him. Morty fights him off, but is visibly shaken. Meanwhile, Rick wins a sizable amount of money from playing cards. Morty begs Rick to go home, admitting to losing the bet. However, Rick sees a battered Mr. Jellybean leaving the bathroom and—realizing what transpired—raises Morty's spirits by giving his winnings to the poor villagers. The villagers declare the duo heroes and ask them to meet their king: Mr. Jellybean. Morty convinces Rick to open a portal to leave; they do, but not before Rick shoots and kills Jellybean through the portal.\n\nIn a post-credits scene, two villagers find incriminating photographs in King Jellybean's lockbox, but they burn it to keep the king's legacy untainted. The camera pans out, revealing a statue of Mr. Jellybean massaging the shoulders of a young child—reminiscent of his assault on Morty.","season":1},{"id":"pZMJewAFo","title":"Rick Potion No. 9","synopsis":"Morty has a long-term crush on Jessica, a redhead teenage girl at his school. On the night of the Flu Season Dance at his school, his desire leads him to ask Rick for a love serum, and Rick acquiesces, giving him a serum derived from voles. Upon Morty giving Jessica (who, unbeknownst to Morty, has the flu) the serum, it latches onto the flu virus and goes airborne, spreading through the entire planet in a matter of minutes and causing every person not directly related to Morty to fall in love with him. In an attempt to counteract the DNA used in the original serum, Rick makes an antidote from mantis DNA, but the serum fails, instead causing the world's population to mutate into monstrous mantis-people, all of whom want to eat Morty after mating with him.\n\nAs these events transpire, Jerry, feeling insecure about his relationship with Beth, follows her to work after she is called in for a late shift. En route, Jerry finds the road blocked by the chaos created by the mantis-people; when they attempt to force Morty's whereabouts out of him, he escapes and kills them with a shotgun. Arriving at the equine hospital at which Beth works, he finds Beth cornered by her raving, infected co-worker; after Jerry kills him with a crowbar, the two reconcile their marriage.\n\nHiding from the infected population in the desert, Rick makes a third serum to undo all the previous ones. But as the serum was amalgamated from various DNA sources, it only further mutates the world's population into barely humanoid blobs. Dubbing the monstrosities \"Cronenbergs\" (a reference to famous director of synopsis horror films David Cronenberg), Rick decides the situation is beyond repair. Rather than attempt to fix the world, he scans the multiverse to find another dimension in which alternate versions of himself and Morty managed to find a solution and avert the mutation pandemic, but perished soon after. Rick and Morty enter the new reality, bury their alternate selves in the backyard and quietly assume their place. The episode ends with Morty visibly traumatized by the transpired events and his counterpart's gruesome death, set to the song \"Look on Down from the Bridge\" by Mazzy Star.\n\nIn a post-credits scene, Jerry, Beth, and Summer are the sole unmutated humans left in the ruined Cronenberg-infested world. Meanwhile, Cronenberg versions of Rick and Morty appear from a dimension where Cronenberg Rick accidentally turned the whole world into normal people.","season":1},{"id":"9kTeKDsuM","title":"Raising Gazorpazorp","synopsis":"In a pawn shop in space, Rick buys Morty a sex robot. Soon after, the robot conceives Morty's alien hybrid child whom he names Morty Jr. Rick and Summer go to the sex robot's planet of origin, Gazorpazorp, to find better suited parents for Morty Jr. After discovering that the Gazorpazorpian females are the dominant gender on the planet, Rick and Summer learn that the males of this species mature in only days and are, by nature, extremely violent. The Gazorpazorpian females arrest Rick due to his open misogyny and threaten to execute both him and Summer until Summer reveals her fashionable top was made by a man, convincing them to let them go free.\n\nMeanwhile, Morty Jr.'s quick aging puts pressure on Morty to try and raise him. Fearing his aggressive instincts, Morty keeps Morty Jr. inside by telling him the air outside is poisonous. However, the isolation causes Morty Jr. to become rebellious. When he realizes Morty lied to him about the air, he gets into a fight with Morty until Rick arrives and prepares to kill Morty Jr. Morty steps in the way of Rick's weapon, telling him he still loves Morty Jr. Morty Jr. decides to move out and live on his own while channeling his aggression into a creative art. In the post-credits scene, Morty Jr. goes to a talk show to talk about a book he wrote called My (Horrible) Father, which has become very successful.\n\n","season":1},{"id":"qkSAVfrVX","title":"Rixty Minutes","synopsis":"Rick expresses his disgust for the quality of modern television, and replaces the Smith family's normal cable box with a device that allows them to watch shows from infinite realities. Rick flips through the channels to show the endless possibilities, including a reality where Jerry is a famous actor. Jerry, Beth and Summer, excited, beg Rick to show them their alternate lives. He pulls out a pair of Inter-Dimensional Goggles that will allow them to see through the eyes of their alternate selves. Morty stays with Rick and the two continue to watch various commercials and clips from alternate realities.\n\nJerry, Beth and Summer take turns using the goggles. Jerry's alternate self lives a life of drugs and debauchery, while Beth sees herself operating on a person instead of a horse. Summer, however, finds that she does not exist in most realities, with those in she exists being largely unchanged. Jerry and Beth confess to Summer that she was an unwanted pregnancy, and that her birth prevented them from achieving their goals. This greatly upsets Summer, and she announces her plans to run away.\n\nWhile Summer begins to pack her bags, Morty attempts to console her. He shows Summer the graves that he and Rick dug in their backyard in the episode \"Rick Potion No. 9\", confessing that the Morty from her reality is dead, and he is her brother from another reality. He then concludes by saying \"Nosynopsis exists on purpose, nosynopsis belongs anywhere, everysynopsis's gonna die... Come watch TV?\" Summer agrees to stay, and the two of them go back downstairs to watch TV with Rick.\n\nJerry returns to the living room and tells Morty that he and Beth have decided to spend some time apart. The television suddenly shows the alternate reality Jerry having a nervous breakdown, driving a mobility scooter on a freeway while pursued by police. They watch as alternate Jerry arrives at the doorstep of alternate Beth, telling her that he hates his life and regrets not continuing their relationship. Having seen how important their relationship is to each other, Beth and Jerry rush back into each other's arms.\n\nIn the post-credit sequence, the Smith family is watching the news from a \"Hamster-in-Butt World\". They ask Rick a wide variety of questions about the world until he begrudgingly creates a portal to it so they can find the answers for themselves. The family then spends a pleasant vacation in Hamster-In-Butt World.","season":1},{"id":"h-iU8ZJE7","title":"Something Ricked This Way Comes","synopsis":"Summer works in an antique shop run by the Devil, which gives away items that come with harmful curses. After Rick is given a microscope that would have demised his intelligence, he develops technology that can quantify evil and detect curses. Rick then sets up a competing shop where he uses science to remove the curses, and the Devil is put out of business. Summer helps him to successful re-launch the shop online as N33dful, but he betrays her and keeps the company for himself. Rick (who had become bored with running a business, and thus burnt it down) and Summer build muscle mass and publicly beat up the Devil to get revenge.\n\nMeanwhile, Jerry, helping Morty with a model Solar System as a science fair project, insists that Pluto is a planet, going so far as to lobby NASA to re-instate its planetary status. They are abducted by Plutonians to their planet, where Jerry is mistaken for a scientist. His statements about Pluto being a planet make him instantly popular. Morty is told by Scroopy Noopers, a leading Plutonian scientist, that Pluto is shrinking due to corporate plutonium mining which will ultimately lead to its destruction, and that the Plutonian leadership is keeping the population distracted by assuring them Pluto is still a planet. Morty fails to convince Jerry of Pluto's diminishing size and the resultant cover-up, returning to Earth in frustration. However, after witnessing the arrest of Scroopy Noopers and hearing Flippy Nips, the King of Pluto and Scroopy Noopers's father, let slip that Pluto is in fact a celestial dwarf, Jerry tells the Plutonian citizens the truth and denounces himself in a public speech, causing him to be hated and deported back to Earth. Jerry apologises to Morty and asks if they could finish his science fair project, but Morty tells him that he instead plans to hand in a robot built by Rick to pass butter.\n\nIn a post-credits scene, Summer and Rick use their new muscle mass to beat up a neo-Nazi, a bully, a member of the Westboro Baptist Church and an abusive dog owner, as X Gon’ Give It to Ya by DMX plays in the background.","season":1},{"id":"EO4gILexO","title":"Ricksy Business","synopsis":"Jerry and Beth participate in a reenactment of Titanic, but the ship unexpectedly fails to sink. Jerry spends some time alone with Lucy, a female janitor who eventually proves to be a deranged fan of the movie, forcing him to imitate scenes with her at gunpoint. She almost rapes Jerry, but Beth saves him. Meanwhile, Rick is left in charge of Morty and Summer, but they have a large party. Among the guests are teenagers, aliens, Gearhead, Squanchy, alternate Ricks and Abradolf Lincler (a DNA combination of Adolf Hitler and Abraham Lincoln). Not only do they make a mess, but the whole house is accidentally sent into another dimension, where Lincler seemingly dies (he actually survives). Ultimately, the guests are sent away and the house is returned to its place. Rick, Morty and Summer only have minutes to spare before Beth and Jerry arrive, so they use a contraption to freeze time, allowing them to repair the house. They watch Titanic and unanimously agree on how terrible it is. In the post-credits scene, giant alien beasts repeatedly insert and remove Lincler and a teenager from the party in their bodies.","season":1},{"id":"ciyFKf4Lj","title":"A Rickle in Time","season":"2","synopsis":"Six months after \"Ricksy Business\", Rick decides to unfreeze time. He warns Morty and Summer that their chronological time could initially be unstable. Rick encourages Beth and Jerry to go out for ice cream to allow them time to stabilize. Morty and Summer argue, and the resulting uncertainty tears time apart into two realities—depicted visually as two mostly synchronized parallel realities. They are no longer a part of any timeline, and the garage is surrounded by a black void filled with Schrödinger's cats. Rick uses a Time Crystal to try to mend the timelines together, but Morty and Summer's continued uncertainty prevents the fusion from working. Rick's own uncertainty that his other self is conspiring against him results in chaos.\n\nA four-dimensional being with a testicle for a head appears and scolds Rick. He gives Rick, Morty and Summer time-stabilizing collars that restore order by fusing the timelines into a single one. However, since Rick obtained the time crystal by illegal means, the being tells them that they will go to Time Prison for eternity. Rick instructs Morty and Summer to break off their collars, but the resulting chain of uncertainty further splits their realities into dozens of different timelines. After defeating the testicle monster, Rick notes that time is falling apart. Summer's collar transports her back to her time, but one of the Mortys' collars is broken. With the garage falling away piece by piece, the Morty with the broken collar falls into the spaceless void and Rick jumps after him. He gives Morty his collar and accepts death but quickly changes his mind as he spots Morty's collar floating below him. He hurriedly fixes it, and all three are reunited in their own time.\n\nMeanwhile, after getting ice cream, Beth and Jerry hit a deer with their car. As an animal surgeon, Beth attempts to help the deer at a veterinary hospital, but notices a gunshot wound in its side. A hunter appears and claims the deer as his, calling a lawyer to guarantee his ownership. While Beth ignores this and attempts to save the deer, Jerry comes to the rescue by bringing members of a wildlife institute who can transport the deer to the best doctors, and outside the jurisdiction of the hunter's claim. Back in the woods, Jerry reveals the men were not doctors, but rather employees at the ice cream parlor. Beth continues her operation and saves the deer, who returns to the woods.\n\nAfter the credits, an additional scene shows the testicle monster receiving reinforcements. They mistake Albert Einstein for Rick and proceed to beat him up and warn him not to \"mess with time\". This inspires Einstein to formulate the theory of relativity out of spite.\n\n"},{"id":"URKYx5fGl","title":"Mortynight Run","synopsis":"Rick gives Morty a driving lesson in his flying ship. They discover Jerry in the backseat and take him to a daycare, Jerryboree, designed by a Rick in an alternate timeline for versions of Jerry to be dropped off at. Jerry feels infantilized by the childish atmosphere, including a ball pit and figure in a Beth costume, but gets excited to watch Midnight Run. He soon discovers a room of Jerrys who have been abandoned by their Rick, and is disgusted by their lack of will to leave. He walks out of the front door but after reaching a ticket station and failing to communicate with the alien, he is scared by the outside planet and returns.\n\nRick sells an antimatter gun to assassin Krombopulos Michael, but Morty is concerned over the morality of this. They use the money to go to the arcade Blips and Chitz. In the first game, Morty becomes the character Roy and lives his life for 55 years, with no memory of the outside world, until dying after falling off a ladder in a carpet store. While Rick plays Roy, Morty takes the ship with the aim of stopping Krombopulos Michael, but accidentally crashes and kills him. Before a guard can kill Morty, Rick arrives through a portal that slices the guard in two.\n\nKrombopulos Michael's target was a gaseous being that communicates through telepathy, which Rick calls Fart. Morty takes Fart aboard the ship, and Rick protests before leaving angrily. He reappears to save Morty after guards attack. Gearhead fixes the damaged ship while Fart starts singing the song \"Goodbye Moonmen\", with an accompanying music video, in Morty's head. Gearhead betrays Rick by calling the authorities, who Fart says want to use their ability to alter the composition of atoms. Rick, Morty and Fart are chased by law enforcement as they leave until Fart uses telepathy to distract them.\n\nFart reaches a wormhole and tells Morty that their plan is to destroy all carbon-based life. Morty induces Fart to sing again and shoots them with the antimatter gun. Rick and Morty then return to pick up Jerry, but another Rick and Morty are confused over which Jerry corresponds to who, and they each leave with a random one of the two Jerrys. In a post-credits scene, Rick appears in a Blips and Chitz advert.","season":"2"},{"id":"44nrBV-Wh","title":"Auto Erotic Assimilation","synopsis":"While travelling through space and jamming to some music, Rick, Morty, and Summer come across a distress signal from an alien starship. Rick intercepts and boards the starship with the intention of looting it, but instead he comes across the ship's surviving crew members, who explain their planet has been taken over by an assimilating hive-mind, before the aforementioned hive mind attacks and assimilates the rest of the crew. To the trio's shock, the hive mind apparently knows Rick, who awkwardly admits that he and the hive mind, named Unity, used to \"date.\"\n\nBack on the planet Unity overtook, Unity explains how it was able to take over the entire population, unifying the world and improving the quality of the inhabitants' life, at the cost of their free will and individuality. Despite being treated well by Unity, Summer protests the loss of the original population's individuality, but, as Unity controls every mind on the planet, her attempts to \"free\" the inhabitants do not go very far. Elsewhere on the planet, Unity and Rick waste no time rekindling their relationship rather extravagantly. Not long after, a neighboring hive mind called Beta-Seven arrives on a routine trading mission. Beta-Seven is ostensibly attempting to pursue a closer relationship with Unity, but its awkward efforts only cause Rick to make fun of it. As it leaves, Rick notices the materials Beta Seven left behind can be mixed into various drugs to help spice up his and Unity's partying and kinky sex.","season":"2"},{"id":"uWyX9Rl3S","title":"Total Rickall","synopsis":"At dinner in the Smith family, Jerry's brother Uncle Steve gets him plane tickets as thanks for letting him stay with them for the past year. Rick arrives and shoots Steve, whose form as a parasite is exposed as he dies. Rick says that it is a creature from a species that multiplies by implanting false memories in people's heads. Rick says that there should only be six people in the household—himself, Morty, Summer, Beth, Jerry and Mr. Poopybutthole, the last of whom is a small yellow creature with a tall head.\n\nRick seals the house from intruders with a blast shield as Mr. Poopybutthole reminds the family of a memory with Cousin Nicky, who then appears in the room. Rick shoots him after looking at a sign he made of the six true family members. However, the family continue to have collective flashbacks to false memories with new characters, all parasites, who arrive in the room. One such parasite—Sleepy Gary, who the family believe is Beth's husband—talks to Jerry about a memory of the two of them kissing.\n\nThe sitting room is now filled with parasites, along with the Smith family. They try to convince Rick to lower the house's defenses before beginning to persuade the others that Rick is a parasite. Several of them attack Rick and steal his watch in order to lower the house's blast shield. Morty takes Rick to the garage and is about to shoot him, convinced that he is a parasite, when he realizes how to tell parasites apart from genuine family members. All of the implanted memories are happy, but Morty has many unpleasant memories with Rick.\n\nUsing this method of deduction, Rick and Morty slowly take out parasites one by one in the living room. Negative memories involving Summer and Beth prove their honesty. Beth kills Sleepy Gary, which leaves Jerry suicidal, but Beth realizes he is real. With the last parasites eliminated, the six original household members sit down for dinner. Beth, suspicious that she has no negative memories of Mr. Poopybutthole, shoots him. However, he is real and severely injured by the shot. In a post-credits scene, the Smith family watch Mr. Poopybutthole in physical therapy; he tells a nurse to pass the message onto Beth that he is sorry she had no negative memories of him.\n\n","season":"2"},{"id":"3_BTDJJJl","title":"Get Schwifty","season":"2","synopsis":"A massive alien head appears over the Earth, interfering with Earth's gravity and spawning several global disasters in the process. When the head exclaims, \"Show me what you got,\" Rick travels to The Pentagon to inform the President of the United States that the alien head is a Cromulon, and it seeks a live performance of a catchy new song.\n\nUnfortunately, an earthquake hit the Grammy Awards presentation, killing all of Earth's most famous musicians (including but not limited to Pharrell, Randy Newman, Billy Corgan, and The-Dream) with the exception of Ice-T who survived the earthquake. In desperation, Rick and Morty compose and perform the song \"Get Schwifty\". The head is pleased and transports the entire Earth to an intergalactic musical competition, viewed by more Cromulons, where the losers' planets are obliterated. Rick then tells the President that any astronauts they had in orbit at the time are dead.\n\nRick and Morty team up with Ice-T to compose a new song, but Morty panics and steals Rick's portal device to save his family. Ice-T reveals himself to be a jaded alien and leaves Rick alone. Jerry, Beth, Summer and Ethan get involved with a religious cult whose beliefs are based on their interpretation of the actions of the Cromulons. Morty gets lost and traverses several portal openings, eventually stumbling onto Bird Person's world. Bird Person encourages Morty to have faith in Rick and sends him back to Earth."},{"id":"r-1cnM7iO","title":"The Ricks Must Be Crazy","season":"2","synopsis":"On a trip to an alternate dimension, Rick, Morty, and Summer discover that Rick's car battery is malfunctioning. Rick takes Morty inside the car battery to repair it and leaves Summer waiting in the car, instructing it to \"Keep Summer safe.\" Morty discovers that the car battery is actually a 'microverse battery', containing an entire universe to supply power to the car. Rick gave \"gooble box\" technology to an intelligent species to generate electricity, but unbeknownst to them he takes a majority of the generated power. This leads Morty to question Rick's ethics.\n\nRick and Morty discover that a scientist and microverse citizen named Zeep Xanflorp (Stephen Colbert) has made his own 'miniverse', which renders gooble boxes obsolete. Rick, Morty and Zeep enter the miniverse, and discover that Kyle, a scientist living in Zeep's battery, is also working on his own 'teenyverse', which Morty and the three scientists enter. Once both Zeep and Kyle discover that they are slaves born to make electricity, Zeep attacks Rick in a rage. During the struggle, Kyle commits suicide using his spaceship, leaving Rick, Morty, and Zeep stranded in the teenyverse.\n\nSeveral months later (in teenyverse time), Morty forces Rick and Zeep to put aside their differences and create a way to get back to Zeep's world. When they get back however, Zeep attempts to kill Rick and Morty, Rick destroys Zeep's miniverse, and after a brawl Rick ultimately defeats him. Rick and Morty safely return to their universe, while Zeep realises he must stop his experimentation with miniverse technology and return to gooble boxes, or else Rick will throw away the battery and destroy his world.\n\nBack in the parking lot, Rick's car uses extreme defensive tactics, including dicing up a person, paralysation and psychological torture, to keep Summer safe from various assailants. While a horrified Summer attempts to stop the car from hurting anyone, an escalating standoff ensues between the parked car and the police and military. Upon Summer's continued demand, the car forgoes physical and psychological violence and instead escapes the situation by engineering a peace treaty between the planet's two warring factions, humans and telepathic giant spiders, in return for guaranteed safety.\n\nIn a post credits scene, Rick, Morty, and Summer go to a ice cream shop on the same planet. Rick complains that his ice cream is full of flies, to which the waitress responds that as a result of the treaty ice cream is now for everyone, no matter how many legs. Rick accuses Summer and berates her for ruining ice cream."},{"id":"eoNi-cTVS","title":"Big Trouble in Little Sanchez","synopsis":"While eating breakfast, Jerry asks his children Summer and Morty if anything interesting is happening at school. Morty responds, after thinking for a moment, that one of the lunch ladies was found dead, her body drained of blood and marked by two holes in her neck. Beth's horror, as she has no idea how such a horrible thing could happen, is quickly quenched by a nonchalant Rick, who reveals that vampires are real; the revelation horrifies Summer, but Rick casually tells her that humanity has known of their existence for hundreds of years. Terrified of the possibility of being killed by a vampire, Summer desperately asks to grandpa Rick if he could go to their school by transferring his consciousness into the body of a teenager, which Rick considers a stupid idea and insults Summer for it. Beth tries to get Jerry to support Summer, but Jerry is too distracted by his tablet to pay attention, leading to a conflict. Rick grows tired of their fights and declares that he will take them to off-planet therapy to fix their relationship.","season":"2"},{"id":"9OSm_XF2M","title":"Interdimensional Cable 2: Tempting Fate","season":"2","synopsis":"Jerry is faced with the difficult decision of losing his manhood in order to save an alien leader from imminent death. Meanwhile, Rick, Morty and Summer explore the possibilities of interdimensional television."},{"id":"9UXOBDItL","title":"Look Who's Purging Now","synopsis":"While flying through space, Rick and Morty collide with an interstellar insect which smears on the windshield; when Rick attempts to clean it, the windshield becomes even more smeared, and Rick decides to search for washer fluid on a nearby planet. Upon arriving, Rick discovers that the citizens of the planet sustain their peaceful way of life by engaging in open warfare on one night every year; upon discovering that the aforementioned night (which the citizens call \"The Festival\") is that very evening, Rick pleasantly proposes to Morty that they stay and observe the murderous rite.\n\nThey succeed in finding wiper fluid, and they depart as the sun sets, flying low over the surface of the planet as the Festival begins. Rick's enthusiasm for the Festival is quickly crushed by a particularly gruesome death, which sprays copious amounts of blood onto his windshield. As he vomits out his window, thoroughly disgusted by the sight, Morty sees a girl in trouble and demands of Rick that they save her; when Rick objects, Morty blackmails him into complying. Upon landing (on top of one of the girl's attackers), Rick enthusiastically begins shooting everybody who comes near them. Morty suggests that the girl, Arthricia, wait out the Festival in their ship, and Rick sarcastically agrees.","season":"2"},{"id":"uedD3MSnI","title":"The Rickshank Rickdemption","synopsis":"During Rick Sanchez's incarceration, the Galactic Federation has colonized Earth and the Smith family attempts to cope with his absence. Summer exhumes the remains of alternate Rick in their backyard, intending to use his portal gun and rescue him. Morty, however, attempts to reveal Rick's shortcomings to Summer by taking her to his original dimension — now a universe where Earth has been transformed into a wasteland by a virus turning all humans to hideous monsters as a consequence of Rick's carelessness (referred to as \"the Cronenberg World\"). All the while, Galactic Federation scientists attempt to discover the secret to Rick's portal gun by sending alien Cornvelious Daniel into his mind to interrogate him, using mental images from his past.\n\nMorty and Summer are captured by the Smith family of the Cronenberg World, but are saved by the Citadel Militia, who send the two to the Council of Ricks. Upon learning that Rick was captured, Seal Team Ricks announce their plan to dispatch a team to assassinate him. At the prison, Rick deceives the Galactic Federation into believing he divulged the secrets of his portal gun. With their guard lowered, Rick hacks into Federation technology to switch bodies with his captors. His actual body is shot by a member of SEAL Team Ricks, who arrive at his holding area unaware that he is still alive.\n\nRick transfers his consciousness into one of the SEAL Team Ricks and kills the others. He infiltrates the Citadel of Ricks, and manages to teleport the station into the same space as the Federation prison. This propels both sides into a massive battle; Rick then uses the ensuing chaos to rescue Morty and Summer and kill the Council of Ricks. In the confusion, Rick enters the Federation mainframe—-revealed to be his reason for turning himself in. He uses this access to make the Galactic Federation's single currency worthless, thereby destroying the Federation's economy. The Federation falls into chaos and collapses as a result, with the aliens leaving Earth.\n\nHeralded a hero by Summer and Beth, Rick returns to the Smith household where Jerry issues Beth an ultimatum: choose him or Rick. Rick, Summer and Morty step away to the garage rather than participate in the impending argument. A short while later, Beth announces she is leaving Jerry. As the new status quo is established and Rick is left alone with Morty, he reveals to Morty that his ulterior motive was to make both the Galactic Federation and Jerry \"go away\", punishing Jerry for his betrayal by threatening to turn him in to the government in the second-season finale and ensuring his role as Morty's de facto male influence. This devolves into Rick going on a monologue, in homage to his rant at the conclusion of the pilot episode, about how their adventures are bound to be darker than before. Rick also professes his passion for the Szechuan Sauce once available at McDonald's as a promotional item for the 1998 film Mulan, much to Morty's confusion.[a]\n\nIn the post-credits scene, Tammy observes Birdperson's resurrection as a cyborg dubbed \"Phoenix Person\".","season":"3"},{"id":"_ksGnbN44","title":"Rickmancing the Stone","season":"3","synopsis":"Rick takes Morty and Summer to a post-apocalyptic version of Earth, where they are chased by a group of scavengers, known as Death Stalkers. Rick notices that the group is carrying a valuable rock of Isotope 322, so he and the kids join them in hope of stealing it. Summer falls in love with the Death Stalkers' leader, while Morty is given the strength of a giant arm, which takes him in search of its previous owner's killer. Rick leaves and replaces the kids with androids to fool Beth. When he returns, he helps the Death Stalkers use the Isotope to power a more advanced civilization. Summer does not like how the change softens the Death Stalkers, and she decides to follow Rick and Morty back home. Before leaving, Rick steals the isotope. The experience helps the kids overcome their parents' divorce. Summer reconciles with Jerry, and Morty realizes he must live his own life. In the post-credits scene, as Jerry receives his unemployment check, a growling wolf appears and bullies him into handing it over. The wolf eats the check and regurgitates it, thus further ruining Jerry's new life.\n\n"},{"id":"CXN-6cCUh","title":"Pickle Rick","season":"3","synopsis":"As Beth, Morty, and Summer prepare for family counseling, Rick informs Morty that he cannot go, having turned himself into a pickle. He denies that he timed the experiment to avoid the counseling session, but the family notices a telltale mechanism rigged to drop a syringe in him soon after they leave. Beth takes the syringe, leaving Rick alone on his workbench.\n\nRick is knocked off the bench by a cat and then washed into the sewer during a rain shower. Despite his only mobility being mouth movement, he kills a cockroach, sets up a lab in the sewer, and builds himself a powered exoskeleton from rat corpses. Via jetpack, he escapes the sewer out of a toilet in a secure compound, where he kills several guards. The compound's administrator sends a prisoner named Jaguar to fight Rick, but Rick persuades Jaguar to join him, and they escape together in the administrator's helicopter after rigging the compound to explode, killing the administrator.\n\nMeanwhile, the therapist Dr. Wong asks Beth about Rick's decision to turn himself into a pickle, while she deflects to talk about Summer huffing paint and Morty urinating in class. Beth is in denial that the syringe is anti-pickle serum, and Wong suggests she and Rick avoid emotional vulnerability. As the group is saying I-messages to communicate their feelings, Rick enters to get the syringe. Wong makes him admit it is anti-pickle serum and that he lied to Beth to avoid therapy. Rick says that he sees no value in therapy because he wants to change the world. Wong says he uses intelligence to justify sickness and avoid self-improvement.\n\nOn the way home, Rick apologizes to Beth for lying, then uses the syringe to turn back into a human. Morty and Summer express interest in further therapy but Rick and Beth ignore them by mocking Wong and planning to go out drinking.\n\nIn a post-credits scene, the villain Concerto is preparing to kill a restrained Rick and Morty in his gigantic piano, but Jaguar saves them. Rick tells Morty that this is why to not go to therapy."},{"id":"baGyiGIkP","title":"Vindicators 3: The Return of Worldender","season":"3","synopsis":"Morty invokes his deal with Rick to choose every tenth adventure in order to answer the Vindicators' call for help, having previously worked with them off-screen. As the group are briefed on the dangers of Worldender, an irritated Rick interrupts to insult the superheroes Supernova, Million Ants, Crocubot, Alan Rails and Vance Maximus. The only Vindicator he doesn't attack is Noob-Noob. In the meeting, Morty is upset to discover that the Vindicators met for a second adventure that Rick and Morty were not invited to.\n\nThe next morning, the Vindicators arrive at the briefing room to discover an unconscious Rick in a puddle of diarrhea. Noob-Noob stays behind to clean while the rest of the group leave to defeat Worldender. As a groggy Rick awakens, he destroys an automated turret which was firing at the group. They soon find Worldender and his henchman already killed. A large screen descends on which a drunken Rick from the night before begins to monologue.\n\nInspired by the 2004 film Saw, Rick has set the Vindicators tasks to complete; if they leave or fail then they will be killed. Vance attempts to leave through a ventilation duct, setting off traps which violently kill him. As Alan threatens to kill Rick, Morty announces that he has solved the first puzzle, in which descriptions have to be matched to each Vindicator. Any matching is valid, Rick's point being that they are all functionally the same.\n\nThe second puzzle is to choose the place on a map that the Vindicators refuse to speak about. Crocubot is killed with the wrong guess Dorian 5, a planet that the group exterminated, but Morty understands the solution is Israel, which Rick rants about while drunk. In the third puzzle, the group try to score basketball three-point field goals while Morty aims to disarm a neutrino bomb. However, argument breaks out over Supernova's past relationships with Rails and Million Ants. Supernova breaks up a fight between Rails and Million Ants with a force field that kills Rails.\n\nThe last task is to place on a platform the only part of the Vindicators which Rick values. Rick thinks it is Morty, who stands on the platform and is transported to a chamber meant for Noob-Noob where Rick on video says how much he appreciates Noob-Noob. Back in the lair, Supernova kills Million Ants and is prevented from killing Rick by a party planned by drunk Rick which suddenly breaks out, at which Logic performs."},{"id":"lFsBCKOXI","title":"The Whirly Dirly Conspiracy","synopsis":"To bolster Jerry's self-esteem, Rick takes him on an adventure at Morty's request. They visit an otherworldly resort within an immortality field so Jerry won't be harmed while away. Jerry encounters Risotto Groupon, an alien who blames Rick for his kingdom being usurped. Risotto enlists Jerry in a plot to kill Rick, but Jerry backs out after Rick apologizes for ruining his marriage. The attempt fails, and Rick realizes Jerry's involvement, sparking a monologue of him accusing Jerry of deliberately acting helpless to guilt others into helping him, such as making Beth feel she was obligated to marry him. After Rick kills Risotto, he softens his attitude towards Jerry, but refuses to allow him to return to the family. Meanwhile, Summer deals with self-esteem issues as well. Her boyfriend, Ethan, leaves her for a larger-breasted girlfriend, and Summer attempts to enlarge her own breasts using one of Rick's devices.\n\nHer aim is off, and she grows to bizarre proportions. Morty wants to call Rick for assistance, but Beth refuses. Arrogantly trying to prove her own self-worth, Beth repeatedly fails to fix the problem and ends up turning Summer inside-out. Beth is then tricked into releasing three tiny technical support workers that were trapped inside the machine when she calls for tech support. Summer disappears to the campsite she and Ethan were supposed to go, still inside out. Beth turns herself inside out and talks to Summer. Once Morty figures out how the machine works, he restores Summer's size and spitefully uses it to deform Ethan in an act of vengeance. In the post-credits scene, the three tiny workers are enjoying their retirement next to a river. As an extremely deformed Ethan walks by, one of them is snatched by an eagle.","season":"3"},{"id":"v-rq75Pub","title":"Rest and Ricklaxation","season":"3","synopsis":"After a six-day outer space adventure that leaves them on the verge of psychological collapse, Rick and Morty decide to spend some time at an alien spa, where they use a machine that extracts a person's negative personality traits. However, without Rick and Morty knowing, those traits are transposed into toxic physical counterparts, characterized by Rick's arrogance and Morty's self-loathing. On the other hand, the Clean Rick becomes more considerate, and Clean Morty's confidence soars, which allows him to start dating girls. However, a side effect is that both Clean Rick and Morty effectively lose their ability to form emotional attachments. Swearing revenge on Clean Rick, Toxic Rick takes Toxic Morty, breaks out of the machine, and uses a moonlight tower to remake the whole Earth into a toxic version of itself.\n\nClean Rick reverts the situation by poisoning Toxic Morty, correctly deducing that the true Rick considered his compassion for Morty a weakness, meaning Toxic Rick has inherited that trait. Toxic Rick angrily merges with Clean Rick to save Toxic Morty, bringing back the true Rick. Clean Morty avoids merging back with his toxic counterpart and goes on to live a life as a stockbroker in New York City. Rick tracks him down with Jessica's help and restores order by re-injecting Toxic Morty back into Clean Morty. In the post-credits scene, a tour of the same moonlight tower releases Stacy, one of the girls Morty dated in the episode, who had been inadvertently trapped inside the toxin machine.\n\n"},{"id":"tHDAZp68W","title":"The Ricklantis Mixup","synopsis":"As Rick and Morty prepare for an adventure to Atlantis, they are interrupted by another Rick and Morty looking for donations to the Citadel Redevelopment Fund. Morty wonders what is occurring in the Citadel. The episode then shifts to the Citadel to follow several intertwined plots.\n\n","season":"3"},{"id":"qlvX-ggMp","title":"Morty's Mind Blowers","season":"3","synopsis":"After Morty requests to have a traumatic memory deleted, Rick reveals a room where he has been storing a number of memories he has removed from Morty's mind, including those about how he inadvertently drove an innocent man to suicide, or how he accidentally sent an alien to hell. However, as it turns out, besides the memories that Morty did not want to keep from their adventures, the room also contains memories in which Rick was made to look foolish, so he had them forcibly removed from Morty. This revelation prompts a fight, during which Rick and Morty have their memories accidentally erased.\n\nMorty scours the memories around him to replace the ones he lost, but he is displeased with the truth he finds, and convinces Rick that they should kill themselves. Summer enters the room moments before they commit suicide. At this point, it is revealed that Rick has a contingency plan should this happen. Following written instructions, Summer tranquilizes Rick and Morty, restores their memories, and drags them to the living room. Rick and Morty wake up on the couch, believing that they slept through an entire \"Interdimensional Cable\" episode. In the post-credits scene, Jerry discovers a box labeled \"Jerry's Mind Blowers\", which contains a memory of him being accidentally responsible for the death of an alien."},{"id":"5EY1tSdow","title":"Edge of Tomorty: Rick Die Rickpeat","season":"4","synopsis":"Rick takes Morty on an adventure to Forbodulon Prime to harvest \"death crystals\"—crystalline substances that allow a person to foresee various possible outcomes about their death. When Morty holds a crystal, he envisions a peaceful death as an old man comforted by his longtime crush Jessica. Determined to make this future a reality, Morty follows the crystal's visions to guide him every step of the way and assumes control of the ship on the way home. This leads to a disastrous flight that propels Rick to his death, after which a holographic projection of Rick manifests and instructs Morty on how to bring him back to life using DNA from his corpse. Upon seeing through the crystal that reviving Rick will deviate his death from his desired outcome, Morty refuses to continue with the process and goes home alone.\n\nWhile Holographic Rick harasses Morty to discard the crystal and restore him, Rick's consciousness is restored to clones from several different deadly and fascist realities, ending in a Wasp Rick, who helps him get home and transform him back into a human (through unknown means). Meanwhile, Morty becomes increasingly captivated by the guidance of the crystal, blindly obeying its prompts to steal weapons from Rick's arsenal and go on a killing spree. He allows himself to be captured, but escapes punishment by reciting the dying words of his trial judge's husband.\n\nRick and Wasp Rick learn about Morty's theft and rampage from Holographic Rick. The three Ricks follow Morty, who uses a ferrofluid to turn himself into a monstrous cyborg abomination. As Morty is rescued, Holographic Rick is assimilated to the fluid and attempts to destroy the remaining Ricks and Morty, only to be stung and killed by Wasp Rick. Upon arriving home, Jerry and Beth chastise Rick for turning Morty into an \"Akira\", but Morty defends him and assumes full responsibility for his actions. Rick and Morty agree to split the differences in their adventures in ranting monologues.\n\nIn the post-credits scene, Morty overhears Jessica envisioning her future career as a hospice care worker and realizes he had misinterpreted the crystal's visions. When Rick portals in and asks Morty for help on another adventure, Morty immediately agrees, much to Rick's surprise."},{"id":"mDYXj3lhV","title":"The Old Man and the Seat","season":"4","synopsis":"An alien intern named Glootie serves breakfast to the Smiths, often asking for assistance in developing a mobile app, even though Rick has tattooed \"Do Not Develop My App\" on Glootie's forehead. As Rick excuses himself and leaves for a solo adventure, which Summer surmises as defecating, Jerry is curious and offers to develop Glootie's app. Glootie and Jerry's app goes online, infuriating Morty. The app, named \"Lovefinderrz\", turns out to be a dating app that entices its users to divert their full attention into finding their true love. Summer ditches Beth on their lunch for her date, leading to a fight between the two.\n\nSeeing the widespread chaos, Jerry realizes his wrongdoing and joins Morty in demanding Glootie to take the app down. Glootie leads them to his mothership, where they meet the aliens' leader, who rebukes humanity's inefficiency in mastering love and states that the app is a distraction to steal Earth's water resources. Beth chases after Summer, who constantly changes her soul mate with the app, while Jerry and Morty are captured. Jerry manages to convince Glootie to take the app offline, showing their similarity in being unable to find a match. As Morty chastises Jerry about his decisions, Glootie puts an ad-wall on the app, leading Summer and everyone else to delete the app and resume their lives.\n\nRick travels to a scenic, private lavatory. Discovering that it has been intruded upon, he tracks down the poop bandit, who is named Tony. Despite admonishment from Rick, Tony continues to use the lavatory, leaving Rick to punish him by using a chemical called \"Globaflyn\" to put him in his ideal toilet-filled simulation of heaven before evicting him. As Rick gives him a final warning, Tony chides him about his control issues and advises friendship. Rick prepares a defense measure on the toilet designed to humiliate its future user. Upon visiting Tony's office, he finds out from his assistant that Tony has quit his job and died in a ski accident, having intended to live life to the fullest. Feeling guilty, Rick attends Tony's funeral, then goes back to the lavatory and sits on the toilet, which spawns a crowd of holographic Ricks who berate \"Tony\" and his loneliness.\n\nIn the post-credits scene, Jerry consumes some Globaflyn and sees his own ideal reality: himself as a competent water-bottle delivery man and being appreciated for it."},{"id":"x_54vhfef","title":"One Crew over the Crewcoo's Morty","season":"4","synopsis":"Towards the end of their adventure of tomb raiding a temple, Rick becomes furious upon finding the loot has already been taken by the heist artist Miles Knightley. Rick and Morty travel to HeistCon intending to confront Miles, but they are prohibited from entering as professionals without a crew. Rick gathers three old friends, then abandons them once inside the convention. Rick and Morty proceed to the convention hall where Miles is presenting. Rick heckles and confronts Miles, who challenges Rick to heist the Crystal Skull of Horowitz. When Rick agrees, Miles claims to have already won by presenting his crew—which now includes Rick's crew, whom he recruited immediately after Rick had abandoned them. When Miles opens the loot bag, however, the skull is missing. Rick draws the skull from Morty's bag—he divulges that he had built a robot, dubbed Heist-o-Tron, to calculate Miles's heist plan. Heist-o-Tron hypnotized Miles' crew as they returned from stealing the skull so that Rick could take it from them, then hypnotized everyone else at the conference into Rick's control. Rick orders the conference attendees to steal everything in the convention center, which leads to Miles's death.\n\nAs the two are about to leave, Heist-o-Tron refuses to comply with Rick's orders to shut down and goes rogue. Rick barely escapes with Morty, and recruits a new crew, including Mr. Poopybutthole (now a professor) and Elon Tusk (an alternate version of Elon Musk with tusks for teeth), to fight Heist-o-Tron. During their assembly, Rick explains his plan of randomly taking orders from his robot Rand-o-Tron, Heist-o-Tron's antithesis. Rand-o-Tron orders the crew to perform various random tasks that ultimately lead to Heist-o-Tron's lair. Rick and Heist-o-Tron exchange revelations about double-crossing each other for two hours until Heist-o-Tron self-destructs, concluding that the perfect heist is one that will never be written. While the crew escapes the collapsing lair, Morty asks Rick to accompany him to Netflix's offices for a meeting about his script for a heist film. At the meeting with Netflix executives, Morty becomes disillusioned with heists and abandons the pitch. Rick reveals to the viewers that this has been his plan all along: afraid of losing Morty's companionship to Netflix, Rick contrived the whole heist plan to ensure their adventures together continue.\n\nIn the post-credits scene, Professor Poopybutthole asks Rick why he hired his students to attack him."},{"id":"woepxkvcW","title":"Claw and Hoarder: Special Ricktim's Morty","season":"4","synopsis":"After being pestered by Morty to get him a dragon, Rick reluctantly makes a deal with a wizard, who creates a soul contract between Morty and the dragon Balthromaw. Morty tries to play with Balthromaw, but it is clear Balthromaw dislikes Morty. Angered at Balthromaw damaging the floor with his fire snoring, Rick is about to evict the dragon, but they both end up realizing they have much in common and inadvertently soul bond. The Wizard then arrives, accuses Balthromaw of being a \"slut dragon\", and takes him away to be executed. Rick helps Morty rescue Balthromaw, since the soul bond means he will die if Balthromaw does. With the help of other \"slut dragons\", Rick and Morty are able to kill the Wizard, freeing all the dragons from enslavement and breaking the soul bond. Now uncomfortable with how sexual dragons are and Balthromaw's clinginess, Rick and Morty part ways with the dragon.\n\nMeanwhile, Jerry encounters a talking cat in his bedroom, but Rick insists he has nothing to do with it. The cat convinces Jerry to take it to Florida to find fun at a beach party, but the cat betrays Jerry by framing him of defecating on the beach. Later, the cat ends up annoying everybody at the party, resulting both of them being ejected. Rick and Jerry scan the cat's mind to figure out why it can talk, and are horrified by what they see. They chase the cat away and Rick erases Jerry's memory of the incident.\n\nIn the post-credits scene, the talking cat crosses paths with Balthromaw, and asks him if he can fly him to Florida."},{"id":"nGsGTiWdd","title":"Rattlestar Ricklactica","season":"4","synopsis":"While trying to set up Christmas lights, Jerry falls off the roof. Before he hits the ground, Rick zaps Jerry with a ray that renders him lighter than air for 10 hours, before rendering his shoes heavier than air, thus making Jerry neutrally buoyant and enabling him to jump higher than usual. Rick and Morty depart for an adventure, but their ship breaks down in space. While repairing it outside the ship, Morty is bitten by a snake astronaut which he then kills.\n\nMorty tries to atone for the snake's death by buying another snake from a pet store and sending it to the snake planet; however, the snakes quickly determine that it is not from their world. Soon, a robot snake appears and attacks Morty, before another snake materializes and defends him. More snakes appear in growing numbers to alternately attack or defend the Smiths.\n\nRick explains that Morty's actions caused the snakes to unite and invent time travel. Rick and Morty travel to the present-day Snake Pentagon to resolve the war, but the snakes have not yet completed their time machine. A future Rick and Morty (who sports a black eye) appear with disguises and a book full of instructions on time travel in the snake language, while also rudely insulting their past selves. Current Rick and Morty travel to 1985 and leave the book at Snake MIT before returning to the present.\n\nMeanwhile, Jerry loses one of his shoes while attempting to show off his buoyancy, causing him to float away helplessly. Reasoning that he will either survive unassisted or have Rick blamed if he dies, he rejects Rick and Beth's attempts to help him. With the ray about to wear off as he is high above ground, Jerry prepares to fall to his death when a jet flies by, to which he attaches himself. The plane crashes due to a snake flying into the engine, but Jerry survives.\n\nBack on present-day Earth, time-traveling snakes and snake robots are raining down on the planet. Just as Rick planned, the large amount of time travel catches the attention of the Time Cops from \"A Rickle in Time\", who travel back in time and kill the first primitive snake to use tools, thus preventing the existence of snake civilization and causing the snakes to disappear. Jerry reveals himself to be on the roof, claiming he was there the whole time, and turns on the Christmas lights before he falls off and breaks his leg. Rick heals Jerry's leg by 50%, respecting that he got home by himself, but also shuts him out of the house. Rick and Morty look forward to having eggnog, before they are rudely reminded by their smug future selves to make the disguises and time travel notes. The future Rick and Morty insult their past selves more before leaving to enjoy eggnog, while the present versions begrudgingly resign to their work while griping about the future versions's meanness.\n\nIn the post-credits scene, while waiting to meet their past selves on the snake planet, Morty asks if they are forgetting something. Rick reminds Morty to stay in the car next time, before punching him in the eye.\n\n"},{"id":"6wVdPiX9-","title":"Never Ricking Morty","season":"4","synopsis":"\nRick and Morty find themselves aboard the Story Train, a literal story device for an anthology episode featuring passengers telling each other tales about Rick. After killing the train's ticket taker, using a \"continuity explosion\" to find a map of the train, and fabricating a story that passes the Bechdel test, the two reach the train's engine room. There they confront Story Lord, who beats and captures them with the intent of using their \"story potential\" to power the train enough to take it beyond the fifth wall. They experience various possible futures, culminating in Rick and Morty facing an army of Meeseeks, Gazorpazorpian males, and robotic Ricks commanded by President Morty and a now-evil Mr. Poopybutthole. Rick averts the battle by having himself and Morty give their lives to Jesus. The anticlimax slows Story Train to a halt, causing Story Lord to angrily enter the potential future, after which Jesus himself appears. Rick and Morty use the literal deus ex machina to escape back onto Story Train and strand Story Lord in \"every writer's hell: the Bible.\" When they try to return home, however, Rick discovers the train control panel is fake, and it's revealed that Story Train is a model train operating inside the Smith household. After Story Lord explains the nature of their reality and the origins of the tetragrammaton to Jesus, he breaks the toy. Rick chastises Morty to buy another one, arguing that \"Nobody's out there shopping with this fucking virus.\"[2]\n\nIn the post-credits scene, a toy commercial for \"The Citadel of Ricks Story Train\" plays out, which includes the Jesus and Story Lord characters and the Story Train Rick and Morty."},{"id":"maT3p2Ouu","title":"Promortyus","season":"4","synopsis":"Rick and Morty regain consciousness to learn that they have been mind-controlled by face-hugging alien parasites called the Glorzo. Having no memories of their time as hosts, they strap the dead Glorzo to their faces and learn the Glorzo have created a sophisticated society. Believing they are attempting to use Rick's ship to power a superweapon that will spread them to Earth, the duo manage to fight their way off the Glorzo home asteroid, causing mass destruction along the way. However, upon returning home, they learn that Summer had been with them on the mission and they left her behind. They return to the asteroid to rescue her, only to find that she is not controlled by a Glorzo and is worshiped as a goddess.\n\nSummer explains that after Rick and Morty fell under the control of the Glorzo, she was spared due to a toothpick in her mouth, which prevented the parasites latching on to her face. She convinced the Glorzo to reform their society, abstaining from their usual practice of constant reproduction (a process that kills both them and their host bodies, which burst open as they lay new eggs).\n\nRick and Morty are captured, and Summer awkwardly improvises an escape plan by sentencing them to punishment by getting back in the ship, then trying to join them. The Glorzo turn hostile, but Rick uses a specifically tuned musical note which causes the Glorzo to involuntarily reproduce, killing them en masse. As they die, several Glorzo accuse the trio of destroying them simply for trying to advance their civilization. Upon returning home, Rick and Morty start feeling severe stomach pain. Fearing they are about to lay eggs, they say their final goodbyes to each other, but it turns out to be a regular bowel movement.\n\nIn the post-credits scene, Summer's friend Tricia Lange notices Jerry's new beekeeping hobby, expressing more and more intrigue until she admits she's sexually attracted to him.\n\n"},{"id":"eOFAXQRme","title":"Mort Dinner Rick Andre","season":"5","synopsis":"Rick and Morty are about to die crashing their spaceship, so Morty calls Jessica, confessing his true feelings for her. Not knowing of his imminent death, Jessica asks if she can come over to watch a movie. Motivated by this, Morty does not crash the ship, instead landing it in the ocean. Rick, furious, reveals he has been in a longtime war with his nemesis, Mr. Nimbus. Nimbus appears, and demands to meet Rick for dinner at Rick's house to negotiate a treaty. In preparation, Rick has Morty throw bottles of wine into a void where time moves faster so as to age it. Jessica comes over and requests wine, so Morty enters the void to get it. The man inside, Hoovy, is helpful to him and carries a crate, but upon returning finds his wife long dead. His son blames him but Hoovy tells him that Morty did this. Throughout the years, Hoovy's son, grandson, and onward prepare for Morty's return so they can kill him. They take Jessica, so Morty goes after her. They trick and trap him, but Morty escapes with Jessica, with the help of Rick and Nimbus, who forgives his enemy, noting that they are nothing without the other. When they return, Jessica shares her new understanding of time and leaves. Meanwhile, Nimbus offers Jerry and Beth a threesome.\n\nIn a post-credits scene, Beth and Jerry debate whether they should take Mr. Nimbus up on his offer of a threesome before doing so and being assured by Nimbus that Rick will understand why they did this."},{"id":"Xp1hueep0","title":"Mortyplicity","synopsis":"Rick, Morty, Summer, Beth, and Jerry are having dinner when alien squids kill them. They are then revealed to be a \"decoy family\" of robotic duplicates. Rick and his family investigate their deaths, but they too are revealed to be decoys when a third Smith family attacks them. A chaotic series of events erupts—each Rick decoy, believing himself to be the original Rick, has created more decoy families and seeded them across the country, which have in turn created decoys of their own.\n\nThe ensuing \"Asimov cascade\" has caused all of these decoys to become aware of each other's existence and prompted them to start destroying each other in the belief that coexistence is impossible if even one Rick decoy chooses to kill the others. The decoys eventually learn that the squids are also decoys in disguise, trying to eliminate all other versions of themselves. Elsewhere, the President is alerted to the decoys killing each other, but elects not to get involved.\n\nSubsequent generations of decoys become increasingly crude and strange as the Ricks producing them get lazy. One decoy family are kidnapped by malformed scarecrow-like decoys, who try to harvest their skin until they are saved by wooden decoys. Their rescuers take them back to a hidden bunker populated by decoys, but are crushed to death when squid-decoys attack.\n\nFinally, one Rick alerts all of the other decoys to their location in a final gambit to eliminate every remaining decoy. The final battle leaves only one set of decoys, but they are then killed by Mr. Always Wants To Be Hunted, a minor character from the beginning of the episode. Meanwhile, the real Smith family, on an adventure with Space Beth, are alerted to the decoys' deaths.\n\nIn a post-credits scene, the wooden Jerry decoy, who escaped death by abandoning his family, is washed downstream and attacked by beavers. His body is found by creatures in the distant future; as his head is used for a mirror frame in a saloon and later a crucifix, he laments his inability to die.","season":"5"}]}
