{"episodes":[{"id":"yK8fI2C97","title":"Pilot","body":"Rick establishes himself as a bad influence on his grandson Morty when it's discovered that Morty has missed a semester of school in the time that he's spent on adventures with Rick. Rick takes Morty to another dimension, known as Dimension 35-C, which has the perfect conditions for growing \"Mega Trees\", which bear \"Mega Fruit\" holding \"Mega Seeds\", which Rick requires for his research. To get past intergalactic customs, Morty hides the Mega Tree seeds in his rectum, but when their cover is blown, Rick & Morty escape while engaging in a shootout with bureaucratic alien insects. Ultimately, the seeds are used to briefly make Morty highly intelligent, causing his parents to believe that he's fine with his education & let Rick stay. But the seeds' energy is wasted with Morty writhing from the aftereffects as Rick informs his grandson that they need to go back & get more before going into a nonsensical rant that they'll be going on a lot more crazy adventures.","photoUrl":"https://www.imdb.com/title/tt2169080/mediaviewer/rm4058720000/?ref_=tt_ov_i"},{"id":"ThZ5euWJj","title":"Lawnmower Dog","body":"Morty's dog Snuffles angers Jerry by continually urinating on the carpet. Upset, Jerry asks Rick for a device that could make Snuffles smarter. Rick makes the device, and it makes Snuffles smart enough for him to be able to do things like a normal human, like going to the bathroom. Meanwhile, Rick plans to enter the dreams of Morty's math teacher, Mr. Goldenfold, in order for him to increase Morty's grades, thus letting Morty adventure with Rick more often. The two enter Goldenfold's dream. The dream takes place on a plane, where Rick pretends to be a terrorist threatening to blow them up if Goldenfold does not give Morty better grades, but Goldenfold decides to fight back and pulls out two machine guns. Rick realizes that Goldenfold has more control over his dreams than he had anticipated, and also reveals that if they die in the dream, they die in real life. Meanwhile, Snuffles attempts to communicate with his owners verbally but is unable. He opens the battery compartment on the helmet and realizes that it can be boosted with additional batteries.\n\nStill stuck in the dream, Rick tries to negotiate with Goldenfold using his idol, Mrs. Pancakes, as a human shield. Instead, chaos descends on the plane. The doors to the plane are opened, and everyone gets sucked out. Mrs. Pancakes finds a parachute and opens it, while Goldenfold has already landed the plane. Rick and Morty grab onto Pancakes, but Goldenfold has created a device to pluck Pancakes out of the sky and leave Rick and Morty to fall in a pool of lava. The two then incept themselves into Pancakes' dreams to slow time down. Pancakes' dreams are of an intergalactic sex club and S&M dungeon, filled with dominatrices. A lingerie-clad Summer makes the two feel uncomfortable, making them stand out. A centaur guard threatens to kill them, and they venture into the centaur's dream, where the three have to run away from a \"legally safe knockoff\" of Freddy Krueger, named Scary Terry. Meanwhile, Snuffles has created a robotic arm and a speaker that he uses to grab things and communicate, albeit in broken English. Snuffles' view on life changes after watching a TV special about dogs being domesticated and being forced into subservience.\n\nStill finding an escape, Rick and Morty travel into a little girl's dream to escape Scary Terry. After returning to what looks like the same dream, the two also find out that Terry can travel across dreams. After building himself a powerful robotic suit, Snuffles changes his name to Snowball and assumes dominance over the household. While in a new dream, Rick and Morty are still being chased by Terry. The two follow him back into his house and enter his dreams. They see that he is fearful of being a failure in his job and save him from being embarrassed in school. In return, he helps them return to reality, and in the process, convince Goldenfold to raise Morty's grades. Back in the regular world, they find that Snowball has led an army of hyper-intelligent dogs to the verge of global domination over humanity. Snowball allows Morty to live by his side while the rest of the world is enslaved at the whim of the dogs. While the dogs are subjecting the humans to similar practices that the humans subjected the dogs to, Morty lives in luxury. Rick reveals to him that the two are actually in Snowball's dream. Rick poisons Morty's kidneys, making Snowball care for Morty's health. Snowball comes out of his dream and realizes that oppressing humans brings heartbreak and cruelty. Snowball and the dogs change their plan and decide instead to inhabit a world of their own.\n\nIn the post-credits scene, the old teacher of Scary Terry's class has been replaced by Scary Glenn, a hippie drum player. Rick and Scary Terry are sitting as his students, smoking marijuana, satisfied with this change.\n\n"},{"id":"p3UHGadxG","title":"Anatomy Park","body":"On Christmas, Rick shrinks Morty and sends him inside the body of a homeless man named Reuben, once a doctor, to save his life. Inside Reuben’s body is Anatomy Park (a parody of Jurassic Park), which houses various deadly diseases that escape their enclosures. Morty and one of the park staff, Annie, flee from the rampaging diseases, which kill the rest of the staff as well as Xenon. Rick ultimately rescues them by enlarging Reuben’s body to the size of the United States before detonating it.\n\nMeanwhile at the family home, Jerry's parents visit along with a man named Jacob, and the family tries to bond without electronic devices at his demand. At lunch, Jerry is dismayed to discover his parents have been engaging in polyamory with Jacob, and soon comes to regret his wish for an electronic-free bonding. Summer’s boyfriend Ethan makes an appearance, enraged over her digital absence, and they fight briefly before reconciling with Jacob’s help. Suddenly, blood from Xenon’s remains rains from the sky, enveloping the outdoors.\n\nAnnie, Rick and Morty return to Earth, and Rick shrinks the former. The fully-sized humans return to the living room, and Rick berates the family for engrossing themselves in their electronics on Christmas.\n\nIn a post-credits scene, Rick contacts Annie and her new associates inside his new patient's body in hopes of recreating Anatomy Park. He hangs up in frustration, and the patient is revealed to be Summer’s boyfriend, Ethan.\n\n"},{"id":"PmYHiZy7N","title":"M. Night Shaym-Aliens!","body":"Aliens hold Rick and Jerry captive in a virtual reality, in an attempt to steal Rick's recipe for Concentrated Dark Matter. As Rick repeatedly attempts escape with Morty (later revealed to be a simulation), he discovers that there are multiple virtual realities layered on top of each other. In contrast, Jerry—despite numerous system glitches—remains completely oblivious, and continually attempts to sell his advertising slogan for apples. Rick finally outsmarts the aliens by giving them a fake recipe, who send Rick and Jerry back to Earth. Their ship explodes as they prepare the concoction.\n\nIn a post-credits scene, Jerry is fired on the spot after debuting his new advertising slogan in the real world. At night, a drunk Rick enters Morty's room and threatens him with a knife, demanding to know if Morty is a simulation. His earnest terror convinces Rick of his innocence, and Rick apologizes before passing out.\n\n"},{"id":"h6zwKVuVL","title":"Meeseeks and Destroy","body":"After a traumatic adventure, Morty strikes a bet with Rick to lead his own. When the other Smiths ask Rick for solutions to several mundane problems, he gives them a Meeseeks Box: a gadget capable of summoning blue humanoids all named \"Mr. Meeseeks\". They live in pain until executing the task they’re given, and then vanish. Rick warns the family to keep their tasks simple.\n\nJerry summons a Meeseeks to take two strokes off his golf game, but struggles. The frustrated creature summons another Meeseeks for help. Soon, Jerry is surrounded by many desperate Meeseeks, yet still cannot improve. Giving in, he and Beth go to dinner together in spite of the Meeseeks' protests. The dumbfounded Meeseeks brawl amongst themselves before concluding that their only hope is to kill Jerry (thus taking all strokes off his game).\n\nA horde of Meeseeks descend upon the restaurant, taking hostages to coerce Jerry out of hiding. Beth convinces him to try his golf swing one last time. Jerry uses a pipe and tomato to demonstrate that his game has improved, and the Meeseeks cease to exist.\n\nConcurrently, Rick and Morty arrive in a poor village in a medieval fantasy world, who request their help to steal a giant's treasure in order to raise money. They climb up a giant beanstalk to the giants' world, but a fatal accident sees them arrested for “murdering” a giant. They are tried in a Giant's Court, but are acquitted via technicality.\n\nThe duo stop at a tavern, and Morty heads to the bathroom. There, an initially gregarious Mr. Jellybean attempts to rape him. Morty fights him off, but is visibly shaken. Meanwhile, Rick wins a sizable amount of money from playing cards. Morty begs Rick to go home, admitting to losing the bet. However, Rick sees a battered Mr. Jellybean leaving the bathroom and—realizing what transpired—raises Morty's spirits by giving his winnings to the poor villagers. The villagers declare the duo heroes and ask them to meet their king: Mr. Jellybean. Morty convinces Rick to open a portal to leave; they do, but not before Rick shoots and kills Jellybean through the portal.\n\nIn a post-credits scene, two villagers find incriminating photographs in King Jellybean's lockbox, but they burn it to keep the king's legacy untainted. The camera pans out, revealing a statue of Mr. Jellybean massaging the shoulders of a young child—reminiscent of his assault on Morty."},{"id":"pZMJewAFo","title":"Rick Potion No. 9","body":"Morty has a long-term crush on Jessica, a redhead teenage girl at his school. On the night of the Flu Season Dance at his school, his desire leads him to ask Rick for a love serum, and Rick acquiesces, giving him a serum derived from voles. Upon Morty giving Jessica (who, unbeknownst to Morty, has the flu) the serum, it latches onto the flu virus and goes airborne, spreading through the entire planet in a matter of minutes and causing every person not directly related to Morty to fall in love with him. In an attempt to counteract the DNA used in the original serum, Rick makes an antidote from mantis DNA, but the serum fails, instead causing the world's population to mutate into monstrous mantis-people, all of whom want to eat Morty after mating with him.\n\nAs these events transpire, Jerry, feeling insecure about his relationship with Beth, follows her to work after she is called in for a late shift. En route, Jerry finds the road blocked by the chaos created by the mantis-people; when they attempt to force Morty's whereabouts out of him, he escapes and kills them with a shotgun. Arriving at the equine hospital at which Beth works, he finds Beth cornered by her raving, infected co-worker; after Jerry kills him with a crowbar, the two reconcile their marriage.\n\nHiding from the infected population in the desert, Rick makes a third serum to undo all the previous ones. But as the serum was amalgamated from various DNA sources, it only further mutates the world's population into barely humanoid blobs. Dubbing the monstrosities \"Cronenbergs\" (a reference to famous director of body horror films David Cronenberg), Rick decides the situation is beyond repair. Rather than attempt to fix the world, he scans the multiverse to find another dimension in which alternate versions of himself and Morty managed to find a solution and avert the mutation pandemic, but perished soon after. Rick and Morty enter the new reality, bury their alternate selves in the backyard and quietly assume their place. The episode ends with Morty visibly traumatized by the transpired events and his counterpart's gruesome death, set to the song \"Look on Down from the Bridge\" by Mazzy Star.\n\nIn a post-credits scene, Jerry, Beth, and Summer are the sole unmutated humans left in the ruined Cronenberg-infested world. Meanwhile, Cronenberg versions of Rick and Morty appear from a dimension where Cronenberg Rick accidentally turned the whole world into normal people."},{"id":"9kTeKDsuM","title":"Raising Gazorpazorp","body":"In a pawn shop in space, Rick buys Morty a sex robot. Soon after, the robot conceives Morty's alien hybrid child whom he names Morty Jr. Rick and Summer go to the sex robot's planet of origin, Gazorpazorp, to find better suited parents for Morty Jr. After discovering that the Gazorpazorpian females are the dominant gender on the planet, Rick and Summer learn that the males of this species mature in only days and are, by nature, extremely violent. The Gazorpazorpian females arrest Rick due to his open misogyny and threaten to execute both him and Summer until Summer reveals her fashionable top was made by a man, convincing them to let them go free.\n\nMeanwhile, Morty Jr.'s quick aging puts pressure on Morty to try and raise him. Fearing his aggressive instincts, Morty keeps Morty Jr. inside by telling him the air outside is poisonous. However, the isolation causes Morty Jr. to become rebellious. When he realizes Morty lied to him about the air, he gets into a fight with Morty until Rick arrives and prepares to kill Morty Jr. Morty steps in the way of Rick's weapon, telling him he still loves Morty Jr. Morty Jr. decides to move out and live on his own while channeling his aggression into a creative art. In the post-credits scene, Morty Jr. goes to a talk show to talk about a book he wrote called My (Horrible) Father, which has become very successful.\n\n"},{"id":"qkSAVfrVX","title":"Rixty Minutes","body":"Rick expresses his disgust for the quality of modern television, and replaces the Smith family's normal cable box with a device that allows them to watch shows from infinite realities. Rick flips through the channels to show the endless possibilities, including a reality where Jerry is a famous actor. Jerry, Beth and Summer, excited, beg Rick to show them their alternate lives. He pulls out a pair of Inter-Dimensional Goggles that will allow them to see through the eyes of their alternate selves. Morty stays with Rick and the two continue to watch various commercials and clips from alternate realities.\n\nJerry, Beth and Summer take turns using the goggles. Jerry's alternate self lives a life of drugs and debauchery, while Beth sees herself operating on a person instead of a horse. Summer, however, finds that she does not exist in most realities, with those in she exists being largely unchanged. Jerry and Beth confess to Summer that she was an unwanted pregnancy, and that her birth prevented them from achieving their goals. This greatly upsets Summer, and she announces her plans to run away.\n\nWhile Summer begins to pack her bags, Morty attempts to console her. He shows Summer the graves that he and Rick dug in their backyard in the episode \"Rick Potion No. 9\", confessing that the Morty from her reality is dead, and he is her brother from another reality. He then concludes by saying \"Nobody exists on purpose, nobody belongs anywhere, everybody's gonna die... Come watch TV?\" Summer agrees to stay, and the two of them go back downstairs to watch TV with Rick.\n\nJerry returns to the living room and tells Morty that he and Beth have decided to spend some time apart. The television suddenly shows the alternate reality Jerry having a nervous breakdown, driving a mobility scooter on a freeway while pursued by police. They watch as alternate Jerry arrives at the doorstep of alternate Beth, telling her that he hates his life and regrets not continuing their relationship. Having seen how important their relationship is to each other, Beth and Jerry rush back into each other's arms.\n\nIn the post-credit sequence, the Smith family is watching the news from a \"Hamster-in-Butt World\". They ask Rick a wide variety of questions about the world until he begrudgingly creates a portal to it so they can find the answers for themselves. The family then spends a pleasant vacation in Hamster-In-Butt World."},{"id":"h-iU8ZJE7","title":"Something Ricked This Way Comes","body":"Summer works in an antique shop run by the Devil, which gives away items that come with harmful curses. After Rick is given a microscope that would have demised his intelligence, he develops technology that can quantify evil and detect curses. Rick then sets up a competing shop where he uses science to remove the curses, and the Devil is put out of business. Summer helps him to successful re-launch the shop online as N33dful, but he betrays her and keeps the company for himself. Rick (who had become bored with running a business, and thus burnt it down) and Summer build muscle mass and publicly beat up the Devil to get revenge.\n\nMeanwhile, Jerry, helping Morty with a model Solar System as a science fair project, insists that Pluto is a planet, going so far as to lobby NASA to re-instate its planetary status. They are abducted by Plutonians to their planet, where Jerry is mistaken for a scientist. His statements about Pluto being a planet make him instantly popular. Morty is told by Scroopy Noopers, a leading Plutonian scientist, that Pluto is shrinking due to corporate plutonium mining which will ultimately lead to its destruction, and that the Plutonian leadership is keeping the population distracted by assuring them Pluto is still a planet. Morty fails to convince Jerry of Pluto's diminishing size and the resultant cover-up, returning to Earth in frustration. However, after witnessing the arrest of Scroopy Noopers and hearing Flippy Nips, the King of Pluto and Scroopy Noopers's father, let slip that Pluto is in fact a celestial dwarf, Jerry tells the Plutonian citizens the truth and denounces himself in a public speech, causing him to be hated and deported back to Earth. Jerry apologises to Morty and asks if they could finish his science fair project, but Morty tells him that he instead plans to hand in a robot built by Rick to pass butter.\n\nIn a post-credits scene, Summer and Rick use their new muscle mass to beat up a neo-Nazi, a bully, a member of the Westboro Baptist Church and an abusive dog owner, as X Gon’ Give It to Ya by DMX plays in the background."},{"id":"EO4gILexO","title":"Ricksy Business","body":"Jerry and Beth participate in a reenactment of Titanic, but the ship unexpectedly fails to sink. Jerry spends some time alone with Lucy, a female janitor who eventually proves to be a deranged fan of the movie, forcing him to imitate scenes with her at gunpoint. She almost rapes Jerry, but Beth saves him. Meanwhile, Rick is left in charge of Morty and Summer, but they have a large party. Among the guests are teenagers, aliens, Gearhead, Squanchy, alternate Ricks and Abradolf Lincler (a DNA combination of Adolf Hitler and Abraham Lincoln). Not only do they make a mess, but the whole house is accidentally sent into another dimension, where Lincler seemingly dies (he actually survives). Ultimately, the guests are sent away and the house is returned to its place. Rick, Morty and Summer only have minutes to spare before Beth and Jerry arrive, so they use a contraption to freeze time, allowing them to repair the house. They watch Titanic and unanimously agree on how terrible it is. In the post-credits scene, giant alien beasts repeatedly insert and remove Lincler and a teenager from the party in their bodies."}]}
